Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.88/PIC32CM-JH00/include/pio/pic32cm5164jh00100.h
#define PIN_PB18H_GCLK_IO4                         _UINT32_(50)
#define MUX_PB18H_GCLK_IO4                         _UINT32_(7) 
#define PINMUX_PB18H_GCLK_IO4                      ((PIN_PB18H_GCLK_IO4 << 16) | MUX_PB18H_GCLK_IO4)
#define PORT_PB18H_GCLK_IO4                        (_UINT32_(1) << 18)

#define PIN_PA11H_GCLK_IO5                         _UINT32_(11)
#define MUX_PA11H_GCLK_IO5                         _UINT32_(7) 
#define PINMUX_PA11H_GCLK_IO5                      ((PIN_PA11H_GCLK_IO5 << 16) | MUX_PA11H_GCLK_IO5)
#define PORT_PA11H_GCLK_IO5                        (_UINT32_(1) << 11)

#define PIN_PA21H_GCLK_IO5                         _UINT32_(21)
#define MUX_PA21H_GCLK_IO5                         _UINT32_(7) 
#define PINMUX_PA21H_GCLK_IO5                      ((PIN_PA21H_GCLK_IO5 << 16) | MUX_PA21H_GCLK_IO5)
#define PORT_PA21H_GCLK_IO5                        (_UINT32_(1) << 21)

#define PIN_PB11H_GCLK_IO5                         _UINT32_(43)
#define MUX_PB11H_GCLK_IO5                         _UINT32_(7) 
#define PINMUX_PB11H_GCLK_IO5                      ((PIN_PB11H_GCLK_IO5 << 16) | MUX_PB11H_GCLK_IO5)
#define PORT_PB11H_GCLK_IO5                        (_UINT32_(1) << 11)

#define PIN_PB19H_GCLK_IO5                         _UINT32_(51)
#define MUX_PB19H_GCLK_IO5                         _UINT32_(7) 
#define PINMUX_PB19H_GCLK_IO5                      ((PIN_PB19H_GCLK_IO5 << 16) | MUX_PB19H_GCLK_IO5)
#define PORT_PB19H_GCLK_IO5                        (_UINT32_(1) << 19)

#define PIN_PA22H_GCLK_IO6                         _UINT32_(22)
#define MUX_PA22H_GCLK_IO6                         _UINT32_(7) 
#define PINMUX_PA22H_GCLK_IO6                      ((PIN_PA22H_GCLK_IO6 << 16) | MUX_PA22H_GCLK_IO6)
#define PORT_PA22H_GCLK_IO6                        (_UINT32_(1) << 22)

#define PIN_PB12H_GCLK_IO6                         _UINT32_(44)
#define MUX_PB12H_GCLK_IO6                         _UINT32_(7) 
#define PINMUX_PB12H_GCLK_IO6                      ((PIN_PB12H_GCLK_IO6 << 16) | MUX_PB12H_GCLK_IO6)
#define PORT_PB12H_GCLK_IO6                        (_UINT32_(1) << 12)

#define PIN_PB20H_GCLK_IO6                         _UINT32_(52)
#define MUX_PB20H_GCLK_IO6                         _UINT32_(7) 
#define PINMUX_PB20H_GCLK_IO6                      ((PIN_PB20H_GCLK_IO6 << 16) | MUX_PB20H_GCLK_IO6)
#define PORT_PB20H_GCLK_IO6                        (_UINT32_(1) << 20)

#define PIN_PA23H_GCLK_IO7                         _UINT32_(23)
#define MUX_PA23H_GCLK_IO7                         _UINT32_(7) 
#define PINMUX_PA23H_GCLK_IO7                      ((PIN_PA23H_GCLK_IO7 << 16) | MUX_PA23H_GCLK_IO7)
#define PORT_PA23H_GCLK_IO7                        (_UINT32_(1) << 23)

#define PIN_PB13H_GCLK_IO7                         _UINT32_(45)
#define MUX_PB13H_GCLK_IO7                         _UINT32_(7) 
#define PINMUX_PB13H_GCLK_IO7                      ((PIN_PB13H_GCLK_IO7 << 16) | MUX_PB13H_GCLK_IO7)
#define PORT_PB13H_GCLK_IO7                        (_UINT32_(1) << 13)

#define PIN_PB21H_GCLK_IO7                         _UINT32_(53)
#define MUX_PB21H_GCLK_IO7                         _UINT32_(7) 
#define PINMUX_PB21H_GCLK_IO7                      ((PIN_PB21H_GCLK_IO7 << 16) | MUX_PB21H_GCLK_IO7)
#define PORT_PB21H_GCLK_IO7                        (_UINT32_(1) << 21)

/* ========== PORT definition for PDEC peripheral ========== */
#define PIN_PA08J_PDEC_QDI0                        _UINT32_(8) 
#define MUX_PA08J_PDEC_QDI0                        _UINT32_(9) 
#define PINMUX_PA08J_PDEC_QDI0                     ((PIN_PA08J_PDEC_QDI0 << 16) | MUX_PA08J_PDEC_QDI0)
#define PORT_PA08J_PDEC_QDI0                       (_UINT32_(1) << 8)

#define PIN_PA16G_PDEC_QDI0                        _UINT32_(16)
#define MUX_PA16G_PDEC_QDI0                        _UINT32_(6) 
#define PINMUX_PA16G_PDEC_QDI0                     ((PIN_PA16G_PDEC_QDI0 << 16) | MUX_PA16G_PDEC_QDI0)
#define PORT_PA16G_PDEC_QDI0                       (_UINT32_(1) << 16)

#define PIN_PA09J_PDEC_QDI1                        _UINT32_(9) 
#define MUX_PA09J_PDEC_QDI1                        _UINT32_(9) 
#define PINMUX_PA09J_PDEC_QDI1                     ((PIN_PA09J_PDEC_QDI1 << 16) | MUX_PA09J_PDEC_QDI1)
#define PORT_PA09J_PDEC_QDI1                       (_UINT32_(1) << 9)

#define PIN_PA17G_PDEC_QDI1                        _UINT32_(17)
#define MUX_PA17G_PDEC_QDI1                        _UINT32_(6) 
#define PINMUX_PA17G_PDEC_QDI1                     ((PIN_PA17G_PDEC_QDI1 << 16) | MUX_PA17G_PDEC_QDI1)
#define PORT_PA17G_PDEC_QDI1                       (_UINT32_(1) << 17)

#define PIN_PA10J_PDEC_QDI2                        _UINT32_(10)
#define MUX_PA10J_PDEC_QDI2                        _UINT32_(9) 
#define PINMUX_PA10J_PDEC_QDI2                     ((PIN_PA10J_PDEC_QDI2 << 16) | MUX_PA10J_PDEC_QDI2)
#define PORT_PA10J_PDEC_QDI2                       (_UINT32_(1) << 10)

#define PIN_PA18G_PDEC_QDI2                        _UINT32_(18)
#define MUX_PA18G_PDEC_QDI2                        _UINT32_(6) 
#define PINMUX_PA18G_PDEC_QDI2                     ((PIN_PA18G_PDEC_QDI2 << 16) | MUX_PA18G_PDEC_QDI2)
#define PORT_PA18G_PDEC_QDI2                       (_UINT32_(1) << 18)

/* ========== PORT definition for PTC peripheral ========== */
#define PIN_PA02K_PTC_DS0                          _UINT32_(2) 
#define MUX_PA02K_PTC_DS0                          _UINT32_(10)
#define PINMUX_PA02K_PTC_DS0                       ((PIN_PA02K_PTC_DS0 << 16) | MUX_PA02K_PTC_DS0)
#define PORT_PA02K_PTC_DS0                         (_UINT32_(1) << 2)

#define PIN_PA03K_PTC_DS1                          _UINT32_(3) 
#define MUX_PA03K_PTC_DS1                          _UINT32_(10)
#define PINMUX_PA03K_PTC_DS1                       ((PIN_PA03K_PTC_DS1 << 16) | MUX_PA03K_PTC_DS1)
#define PORT_PA03K_PTC_DS1                         (_UINT32_(1) << 3)

#define PIN_PA04K_PTC_DS2                          _UINT32_(4) 
#define MUX_PA04K_PTC_DS2                          _UINT32_(10)
#define PINMUX_PA04K_PTC_DS2                       ((PIN_PA04K_PTC_DS2 << 16) | MUX_PA04K_PTC_DS2)
#define PORT_PA04K_PTC_DS2                         (_UINT32_(1) << 4)

#define PIN_PA05K_PTC_DS3                          _UINT32_(5) 
#define MUX_PA05K_PTC_DS3                          _UINT32_(10)
#define PINMUX_PA05K_PTC_DS3                       ((PIN_PA05K_PTC_DS3 << 16) | MUX_PA05K_PTC_DS3)
#define PORT_PA05K_PTC_DS3                         (_UINT32_(1) << 5)

#define PIN_PA06K_PTC_DS4                          _UINT32_(6) 
#define MUX_PA06K_PTC_DS4                          _UINT32_(10)
#define PINMUX_PA06K_PTC_DS4                       ((PIN_PA06K_PTC_DS4 << 16) | MUX_PA06K_PTC_DS4)
#define PORT_PA06K_PTC_DS4                         (_UINT32_(1) << 6)

