Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.88/PIC32CM-JH00/include/pio/pic32cm5164jh00100.h
#define PIN_PA07K_PTC_DS5                          _UINT32_(7) 
#define MUX_PA07K_PTC_DS5                          _UINT32_(10)
#define PINMUX_PA07K_PTC_DS5                       ((PIN_PA07K_PTC_DS5 << 16) | MUX_PA07K_PTC_DS5)
#define PORT_PA07K_PTC_DS5                         (_UINT32_(1) << 7)

#define PIN_PB00K_PTC_DS6                          _UINT32_(32)
#define MUX_PB00K_PTC_DS6                          _UINT32_(10)
#define PINMUX_PB00K_PTC_DS6                       ((PIN_PB00K_PTC_DS6 << 16) | MUX_PB00K_PTC_DS6)
#define PORT_PB00K_PTC_DS6                         (_UINT32_(1) << 0)

#define PIN_PB01K_PTC_DS7                          _UINT32_(33)
#define MUX_PB01K_PTC_DS7                          _UINT32_(10)
#define PINMUX_PB01K_PTC_DS7                       ((PIN_PB01K_PTC_DS7 << 16) | MUX_PB01K_PTC_DS7)
#define PORT_PB01K_PTC_DS7                         (_UINT32_(1) << 1)

#define PIN_PB02K_PTC_DS8                          _UINT32_(34)
#define MUX_PB02K_PTC_DS8                          _UINT32_(10)
#define PINMUX_PB02K_PTC_DS8                       ((PIN_PB02K_PTC_DS8 << 16) | MUX_PB02K_PTC_DS8)
#define PORT_PB02K_PTC_DS8                         (_UINT32_(1) << 2)

#define PIN_PB03K_PTC_DS9                          _UINT32_(35)
#define MUX_PB03K_PTC_DS9                          _UINT32_(10)
#define PINMUX_PB03K_PTC_DS9                       ((PIN_PB03K_PTC_DS9 << 16) | MUX_PB03K_PTC_DS9)
#define PORT_PB03K_PTC_DS9                         (_UINT32_(1) << 3)

#define PIN_PB04K_PTC_DS10                         _UINT32_(36)
#define MUX_PB04K_PTC_DS10                         _UINT32_(10)
#define PINMUX_PB04K_PTC_DS10                      ((PIN_PB04K_PTC_DS10 << 16) | MUX_PB04K_PTC_DS10)
#define PORT_PB04K_PTC_DS10                        (_UINT32_(1) << 4)

#define PIN_PB05K_PTC_DS11                         _UINT32_(37)
#define MUX_PB05K_PTC_DS11                         _UINT32_(10)
#define PINMUX_PB05K_PTC_DS11                      ((PIN_PB05K_PTC_DS11 << 16) | MUX_PB05K_PTC_DS11)
#define PORT_PB05K_PTC_DS11                        (_UINT32_(1) << 5)

#define PIN_PB06K_PTC_DS12                         _UINT32_(38)
#define MUX_PB06K_PTC_DS12                         _UINT32_(10)
#define PINMUX_PB06K_PTC_DS12                      ((PIN_PB06K_PTC_DS12 << 16) | MUX_PB06K_PTC_DS12)
#define PORT_PB06K_PTC_DS12                        (_UINT32_(1) << 6)

#define PIN_PB07K_PTC_DS13                         _UINT32_(39)
#define MUX_PB07K_PTC_DS13                         _UINT32_(10)
#define PINMUX_PB07K_PTC_DS13                      ((PIN_PB07K_PTC_DS13 << 16) | MUX_PB07K_PTC_DS13)
#define PORT_PB07K_PTC_DS13                        (_UINT32_(1) << 7)

#define PIN_PB08K_PTC_DS14                         _UINT32_(40)
#define MUX_PB08K_PTC_DS14                         _UINT32_(10)
#define PINMUX_PB08K_PTC_DS14                      ((PIN_PB08K_PTC_DS14 << 16) | MUX_PB08K_PTC_DS14)
#define PORT_PB08K_PTC_DS14                        (_UINT32_(1) << 8)

#define PIN_PB09K_PTC_DS15                         _UINT32_(41)
#define MUX_PB09K_PTC_DS15                         _UINT32_(10)
#define PINMUX_PB09K_PTC_DS15                      ((PIN_PB09K_PTC_DS15 << 16) | MUX_PB09K_PTC_DS15)
#define PORT_PB09K_PTC_DS15                        (_UINT32_(1) << 9)

#define PIN_PA08K_PTC_DS16                         _UINT32_(8) 
#define MUX_PA08K_PTC_DS16                         _UINT32_(10)
#define PINMUX_PA08K_PTC_DS16                      ((PIN_PA08K_PTC_DS16 << 16) | MUX_PA08K_PTC_DS16)
#define PORT_PA08K_PTC_DS16                        (_UINT32_(1) << 8)

#define PIN_PA09K_PTC_DS17                         _UINT32_(9) 
#define MUX_PA09K_PTC_DS17                         _UINT32_(10)
#define PINMUX_PA09K_PTC_DS17                      ((PIN_PA09K_PTC_DS17 << 16) | MUX_PA09K_PTC_DS17)
#define PORT_PA09K_PTC_DS17                        (_UINT32_(1) << 9)

#define PIN_PA10K_PTC_DS18                         _UINT32_(10)
#define MUX_PA10K_PTC_DS18                         _UINT32_(10)
#define PINMUX_PA10K_PTC_DS18                      ((PIN_PA10K_PTC_DS18 << 16) | MUX_PA10K_PTC_DS18)
#define PORT_PA10K_PTC_DS18                        (_UINT32_(1) << 10)

#define PIN_PA11K_PTC_DS19                         _UINT32_(11)
#define MUX_PA11K_PTC_DS19                         _UINT32_(10)
#define PINMUX_PA11K_PTC_DS19                      ((PIN_PA11K_PTC_DS19 << 16) | MUX_PA11K_PTC_DS19)
#define PORT_PA11K_PTC_DS19                        (_UINT32_(1) << 11)

#define PIN_PA16K_PTC_DS20                         _UINT32_(16)
#define MUX_PA16K_PTC_DS20                         _UINT32_(10)
#define PINMUX_PA16K_PTC_DS20                      ((PIN_PA16K_PTC_DS20 << 16) | MUX_PA16K_PTC_DS20)
#define PORT_PA16K_PTC_DS20                        (_UINT32_(1) << 16)

#define PIN_PA17K_PTC_DS21                         _UINT32_(17)
#define MUX_PA17K_PTC_DS21                         _UINT32_(10)
#define PINMUX_PA17K_PTC_DS21                      ((PIN_PA17K_PTC_DS21 << 16) | MUX_PA17K_PTC_DS21)
#define PORT_PA17K_PTC_DS21                        (_UINT32_(1) << 17)

#define PIN_PA18K_PTC_DS22                         _UINT32_(18)
#define MUX_PA18K_PTC_DS22                         _UINT32_(10)
#define PINMUX_PA18K_PTC_DS22                      ((PIN_PA18K_PTC_DS22 << 16) | MUX_PA18K_PTC_DS22)
#define PORT_PA18K_PTC_DS22                        (_UINT32_(1) << 18)

#define PIN_PA19K_PTC_DS23                         _UINT32_(19)
#define MUX_PA19K_PTC_DS23                         _UINT32_(10)
#define PINMUX_PA19K_PTC_DS23                      ((PIN_PA19K_PTC_DS23 << 16) | MUX_PA19K_PTC_DS23)
#define PORT_PA19K_PTC_DS23                        (_UINT32_(1) << 19)

#define PIN_PA20K_PTC_DS24                         _UINT32_(20)
#define MUX_PA20K_PTC_DS24                         _UINT32_(10)
#define PINMUX_PA20K_PTC_DS24                      ((PIN_PA20K_PTC_DS24 << 16) | MUX_PA20K_PTC_DS24)
#define PORT_PA20K_PTC_DS24                        (_UINT32_(1) << 20)

#define PIN_PA21K_PTC_DS25                         _UINT32_(21)
#define MUX_PA21K_PTC_DS25                         _UINT32_(10)
#define PINMUX_PA21K_PTC_DS25                      ((PIN_PA21K_PTC_DS25 << 16) | MUX_PA21K_PTC_DS25)
#define PORT_PA21K_PTC_DS25                        (_UINT32_(1) << 21)

