Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.88/PIC32CM-JH00/include/pio/pic32cm5164jh00100.h
#define PIN_PA22K_PTC_DS26                         _UINT32_(22)
#define MUX_PA22K_PTC_DS26                         _UINT32_(10)
#define PINMUX_PA22K_PTC_DS26                      ((PIN_PA22K_PTC_DS26 << 16) | MUX_PA22K_PTC_DS26)
#define PORT_PA22K_PTC_DS26                        (_UINT32_(1) << 22)

#define PIN_PA23K_PTC_DS27                         _UINT32_(23)
#define MUX_PA23K_PTC_DS27                         _UINT32_(10)
#define PINMUX_PA23K_PTC_DS27                      ((PIN_PA23K_PTC_DS27 << 16) | MUX_PA23K_PTC_DS27)
#define PORT_PA23K_PTC_DS27                        (_UINT32_(1) << 23)

#define PIN_PB12K_PTC_DS28                         _UINT32_(44)
#define MUX_PB12K_PTC_DS28                         _UINT32_(10)
#define PINMUX_PB12K_PTC_DS28                      ((PIN_PB12K_PTC_DS28 << 16) | MUX_PB12K_PTC_DS28)
#define PORT_PB12K_PTC_DS28                        (_UINT32_(1) << 12)

#define PIN_PB13K_PTC_DS29                         _UINT32_(45)
#define MUX_PB13K_PTC_DS29                         _UINT32_(10)
#define PINMUX_PB13K_PTC_DS29                      ((PIN_PB13K_PTC_DS29 << 16) | MUX_PB13K_PTC_DS29)
#define PORT_PB13K_PTC_DS29                        (_UINT32_(1) << 13)

#define PIN_PB14K_PTC_DS30                         _UINT32_(46)
#define MUX_PB14K_PTC_DS30                         _UINT32_(10)
#define PINMUX_PB14K_PTC_DS30                      ((PIN_PB14K_PTC_DS30 << 16) | MUX_PB14K_PTC_DS30)
#define PORT_PB14K_PTC_DS30                        (_UINT32_(1) << 14)

#define PIN_PB15K_PTC_DS31                         _UINT32_(47)
#define MUX_PB15K_PTC_DS31                         _UINT32_(10)
#define PINMUX_PB15K_PTC_DS31                      ((PIN_PB15K_PTC_DS31 << 16) | MUX_PB15K_PTC_DS31)
#define PORT_PB15K_PTC_DS31                        (_UINT32_(1) << 15)

#define PIN_PA08B_PTC_X0                           _UINT32_(8) 
#define MUX_PA08B_PTC_X0                           _UINT32_(1) 
#define PINMUX_PA08B_PTC_X0                        ((PIN_PA08B_PTC_X0 << 16) | MUX_PA08B_PTC_X0)
#define PORT_PA08B_PTC_X0                          (_UINT32_(1) << 8)

#define PIN_PA09B_PTC_X1                           _UINT32_(9) 
#define MUX_PA09B_PTC_X1                           _UINT32_(1) 
#define PINMUX_PA09B_PTC_X1                        ((PIN_PA09B_PTC_X1 << 16) | MUX_PA09B_PTC_X1)
#define PORT_PA09B_PTC_X1                          (_UINT32_(1) << 9)

#define PIN_PA10B_PTC_X2                           _UINT32_(10)
#define MUX_PA10B_PTC_X2                           _UINT32_(1) 
#define PINMUX_PA10B_PTC_X2                        ((PIN_PA10B_PTC_X2 << 16) | MUX_PA10B_PTC_X2)
#define PORT_PA10B_PTC_X2                          (_UINT32_(1) << 10)

#define PIN_PA11B_PTC_X3                           _UINT32_(11)
#define MUX_PA11B_PTC_X3                           _UINT32_(1) 
#define PINMUX_PA11B_PTC_X3                        ((PIN_PA11B_PTC_X3 << 16) | MUX_PA11B_PTC_X3)
#define PORT_PA11B_PTC_X3                          (_UINT32_(1) << 11)

#define PIN_PA16B_PTC_X4                           _UINT32_(16)
#define MUX_PA16B_PTC_X4                           _UINT32_(1) 
#define PINMUX_PA16B_PTC_X4                        ((PIN_PA16B_PTC_X4 << 16) | MUX_PA16B_PTC_X4)
#define PORT_PA16B_PTC_X4                          (_UINT32_(1) << 16)

#define PIN_PA17B_PTC_X5                           _UINT32_(17)
#define MUX_PA17B_PTC_X5                           _UINT32_(1) 
#define PINMUX_PA17B_PTC_X5                        ((PIN_PA17B_PTC_X5 << 16) | MUX_PA17B_PTC_X5)
#define PORT_PA17B_PTC_X5                          (_UINT32_(1) << 17)

#define PIN_PA18B_PTC_X6                           _UINT32_(18)
#define MUX_PA18B_PTC_X6                           _UINT32_(1) 
#define PINMUX_PA18B_PTC_X6                        ((PIN_PA18B_PTC_X6 << 16) | MUX_PA18B_PTC_X6)
#define PORT_PA18B_PTC_X6                          (_UINT32_(1) << 18)

#define PIN_PA19B_PTC_X7                           _UINT32_(19)
#define MUX_PA19B_PTC_X7                           _UINT32_(1) 
#define PINMUX_PA19B_PTC_X7                        ((PIN_PA19B_PTC_X7 << 16) | MUX_PA19B_PTC_X7)
#define PORT_PA19B_PTC_X7                          (_UINT32_(1) << 19)

#define PIN_PA20B_PTC_X8                           _UINT32_(20)
#define MUX_PA20B_PTC_X8                           _UINT32_(1) 
#define PINMUX_PA20B_PTC_X8                        ((PIN_PA20B_PTC_X8 << 16) | MUX_PA20B_PTC_X8)
#define PORT_PA20B_PTC_X8                          (_UINT32_(1) << 20)

#define PIN_PA21B_PTC_X9                           _UINT32_(21)
#define MUX_PA21B_PTC_X9                           _UINT32_(1) 
#define PINMUX_PA21B_PTC_X9                        ((PIN_PA21B_PTC_X9 << 16) | MUX_PA21B_PTC_X9)
#define PORT_PA21B_PTC_X9                          (_UINT32_(1) << 21)

#define PIN_PA22B_PTC_X10                          _UINT32_(22)
#define MUX_PA22B_PTC_X10                          _UINT32_(1) 
#define PINMUX_PA22B_PTC_X10                       ((PIN_PA22B_PTC_X10 << 16) | MUX_PA22B_PTC_X10)
#define PORT_PA22B_PTC_X10                         (_UINT32_(1) << 22)

#define PIN_PA23B_PTC_X11                          _UINT32_(23)
#define MUX_PA23B_PTC_X11                          _UINT32_(1) 
#define PINMUX_PA23B_PTC_X11                       ((PIN_PA23B_PTC_X11 << 16) | MUX_PA23B_PTC_X11)
#define PORT_PA23B_PTC_X11                         (_UINT32_(1) << 23)

#define PIN_PB12B_PTC_X12                          _UINT32_(44)
#define MUX_PB12B_PTC_X12                          _UINT32_(1) 
#define PINMUX_PB12B_PTC_X12                       ((PIN_PB12B_PTC_X12 << 16) | MUX_PB12B_PTC_X12)
#define PORT_PB12B_PTC_X12                         (_UINT32_(1) << 12)

#define PIN_PB13B_PTC_X13                          _UINT32_(45)
#define MUX_PB13B_PTC_X13                          _UINT32_(1) 
#define PINMUX_PB13B_PTC_X13                       ((PIN_PB13B_PTC_X13 << 16) | MUX_PB13B_PTC_X13)
#define PORT_PB13B_PTC_X13                         (_UINT32_(1) << 13)

#define PIN_PB14B_PTC_X14                          _UINT32_(46)
#define MUX_PB14B_PTC_X14                          _UINT32_(1) 
#define PINMUX_PB14B_PTC_X14                       ((PIN_PB14B_PTC_X14 << 16) | MUX_PB14B_PTC_X14)
#define PORT_PB14B_PTC_X14                         (_UINT32_(1) << 14)

#define PIN_PB15B_PTC_X15                          _UINT32_(47)
#define MUX_PB15B_PTC_X15                          _UINT32_(1) 
#define PINMUX_PB15B_PTC_X15                       ((PIN_PB15B_PTC_X15 << 16) | MUX_PB15B_PTC_X15)
#define PORT_PB15B_PTC_X15                         (_UINT32_(1) << 15)

#define PIN_PA02B_PTC_Y0                           _UINT32_(2) 
#define MUX_PA02B_PTC_Y0                           _UINT32_(1) 
#define PINMUX_PA02B_PTC_Y0                        ((PIN_PA02B_PTC_Y0 << 16) | MUX_PA02B_PTC_Y0)
#define PORT_PA02B_PTC_Y0                          (_UINT32_(1) << 2)

#define PIN_PA03B_PTC_Y1                           _UINT32_(3) 
#define MUX_PA03B_PTC_Y1                           _UINT32_(1) 
#define PINMUX_PA03B_PTC_Y1                        ((PIN_PA03B_PTC_Y1 << 16) | MUX_PA03B_PTC_Y1)
#define PORT_PA03B_PTC_Y1                          (_UINT32_(1) << 3)

#define PIN_PA04B_PTC_Y2                           _UINT32_(4) 
#define MUX_PA04B_PTC_Y2                           _UINT32_(1) 
#define PINMUX_PA04B_PTC_Y2                        ((PIN_PA04B_PTC_Y2 << 16) | MUX_PA04B_PTC_Y2)
#define PORT_PA04B_PTC_Y2                          (_UINT32_(1) << 4)

