Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.88/PIC32CM-JH00/include/pio/pic32cm5164jh00100.h
#define PIN_PA05B_PTC_Y3                           _UINT32_(5) 
#define MUX_PA05B_PTC_Y3                           _UINT32_(1) 
#define PINMUX_PA05B_PTC_Y3                        ((PIN_PA05B_PTC_Y3 << 16) | MUX_PA05B_PTC_Y3)
#define PORT_PA05B_PTC_Y3                          (_UINT32_(1) << 5)

#define PIN_PA06B_PTC_Y4                           _UINT32_(6) 
#define MUX_PA06B_PTC_Y4                           _UINT32_(1) 
#define PINMUX_PA06B_PTC_Y4                        ((PIN_PA06B_PTC_Y4 << 16) | MUX_PA06B_PTC_Y4)
#define PORT_PA06B_PTC_Y4                          (_UINT32_(1) << 6)

#define PIN_PA07B_PTC_Y5                           _UINT32_(7) 
#define MUX_PA07B_PTC_Y5                           _UINT32_(1) 
#define PINMUX_PA07B_PTC_Y5                        ((PIN_PA07B_PTC_Y5 << 16) | MUX_PA07B_PTC_Y5)
#define PORT_PA07B_PTC_Y5                          (_UINT32_(1) << 7)

#define PIN_PB00B_PTC_Y6                           _UINT32_(32)
#define MUX_PB00B_PTC_Y6                           _UINT32_(1) 
#define PINMUX_PB00B_PTC_Y6                        ((PIN_PB00B_PTC_Y6 << 16) | MUX_PB00B_PTC_Y6)
#define PORT_PB00B_PTC_Y6                          (_UINT32_(1) << 0)

#define PIN_PB01B_PTC_Y7                           _UINT32_(33)
#define MUX_PB01B_PTC_Y7                           _UINT32_(1) 
#define PINMUX_PB01B_PTC_Y7                        ((PIN_PB01B_PTC_Y7 << 16) | MUX_PB01B_PTC_Y7)
#define PORT_PB01B_PTC_Y7                          (_UINT32_(1) << 1)

#define PIN_PB02B_PTC_Y8                           _UINT32_(34)
#define MUX_PB02B_PTC_Y8                           _UINT32_(1) 
#define PINMUX_PB02B_PTC_Y8                        ((PIN_PB02B_PTC_Y8 << 16) | MUX_PB02B_PTC_Y8)
#define PORT_PB02B_PTC_Y8                          (_UINT32_(1) << 2)

#define PIN_PB03B_PTC_Y9                           _UINT32_(35)
#define MUX_PB03B_PTC_Y9                           _UINT32_(1) 
#define PINMUX_PB03B_PTC_Y9                        ((PIN_PB03B_PTC_Y9 << 16) | MUX_PB03B_PTC_Y9)
#define PORT_PB03B_PTC_Y9                          (_UINT32_(1) << 3)

#define PIN_PB04B_PTC_Y10                          _UINT32_(36)
#define MUX_PB04B_PTC_Y10                          _UINT32_(1) 
#define PINMUX_PB04B_PTC_Y10                       ((PIN_PB04B_PTC_Y10 << 16) | MUX_PB04B_PTC_Y10)
#define PORT_PB04B_PTC_Y10                         (_UINT32_(1) << 4)

#define PIN_PB05B_PTC_Y11                          _UINT32_(37)
#define MUX_PB05B_PTC_Y11                          _UINT32_(1) 
#define PINMUX_PB05B_PTC_Y11                       ((PIN_PB05B_PTC_Y11 << 16) | MUX_PB05B_PTC_Y11)
#define PORT_PB05B_PTC_Y11                         (_UINT32_(1) << 5)

#define PIN_PB06B_PTC_Y12                          _UINT32_(38)
#define MUX_PB06B_PTC_Y12                          _UINT32_(1) 
#define PINMUX_PB06B_PTC_Y12                       ((PIN_PB06B_PTC_Y12 << 16) | MUX_PB06B_PTC_Y12)
#define PORT_PB06B_PTC_Y12                         (_UINT32_(1) << 6)

#define PIN_PB07B_PTC_Y13                          _UINT32_(39)
#define MUX_PB07B_PTC_Y13                          _UINT32_(1) 
#define PINMUX_PB07B_PTC_Y13                       ((PIN_PB07B_PTC_Y13 << 16) | MUX_PB07B_PTC_Y13)
#define PORT_PB07B_PTC_Y13                         (_UINT32_(1) << 7)

#define PIN_PB08B_PTC_Y14                          _UINT32_(40)
#define MUX_PB08B_PTC_Y14                          _UINT32_(1) 
#define PINMUX_PB08B_PTC_Y14                       ((PIN_PB08B_PTC_Y14 << 16) | MUX_PB08B_PTC_Y14)
#define PORT_PB08B_PTC_Y14                         (_UINT32_(1) << 8)

#define PIN_PB09B_PTC_Y15                          _UINT32_(41)
#define MUX_PB09B_PTC_Y15                          _UINT32_(1) 
#define PINMUX_PB09B_PTC_Y15                       ((PIN_PB09B_PTC_Y15 << 16) | MUX_PB09B_PTC_Y15)
#define PORT_PB09B_PTC_Y15                         (_UINT32_(1) << 9)

#define PIN_PA08B_PTC_Y16                          _UINT32_(8) 
#define MUX_PA08B_PTC_Y16                          _UINT32_(1) 
#define PINMUX_PA08B_PTC_Y16                       ((PIN_PA08B_PTC_Y16 << 16) | MUX_PA08B_PTC_Y16)
#define PORT_PA08B_PTC_Y16                         (_UINT32_(1) << 8)

#define PIN_PA09B_PTC_Y17                          _UINT32_(9) 
#define MUX_PA09B_PTC_Y17                          _UINT32_(1) 
#define PINMUX_PA09B_PTC_Y17                       ((PIN_PA09B_PTC_Y17 << 16) | MUX_PA09B_PTC_Y17)
#define PORT_PA09B_PTC_Y17                         (_UINT32_(1) << 9)

#define PIN_PA10B_PTC_Y18                          _UINT32_(10)
#define MUX_PA10B_PTC_Y18                          _UINT32_(1) 
#define PINMUX_PA10B_PTC_Y18                       ((PIN_PA10B_PTC_Y18 << 16) | MUX_PA10B_PTC_Y18)
#define PORT_PA10B_PTC_Y18                         (_UINT32_(1) << 10)

#define PIN_PA11B_PTC_Y19                          _UINT32_(11)
#define MUX_PA11B_PTC_Y19                          _UINT32_(1) 
#define PINMUX_PA11B_PTC_Y19                       ((PIN_PA11B_PTC_Y19 << 16) | MUX_PA11B_PTC_Y19)
#define PORT_PA11B_PTC_Y19                         (_UINT32_(1) << 11)

#define PIN_PA16B_PTC_Y20                          _UINT32_(16)
#define MUX_PA16B_PTC_Y20                          _UINT32_(1) 
#define PINMUX_PA16B_PTC_Y20                       ((PIN_PA16B_PTC_Y20 << 16) | MUX_PA16B_PTC_Y20)
#define PORT_PA16B_PTC_Y20                         (_UINT32_(1) << 16)

#define PIN_PA17B_PTC_Y21                          _UINT32_(17)
#define MUX_PA17B_PTC_Y21                          _UINT32_(1) 
#define PINMUX_PA17B_PTC_Y21                       ((PIN_PA17B_PTC_Y21 << 16) | MUX_PA17B_PTC_Y21)
#define PORT_PA17B_PTC_Y21                         (_UINT32_(1) << 17)

#define PIN_PA18B_PTC_Y22                          _UINT32_(18)
#define MUX_PA18B_PTC_Y22                          _UINT32_(1) 
#define PINMUX_PA18B_PTC_Y22                       ((PIN_PA18B_PTC_Y22 << 16) | MUX_PA18B_PTC_Y22)
#define PORT_PA18B_PTC_Y22                         (_UINT32_(1) << 18)

#define PIN_PA19B_PTC_Y23                          _UINT32_(19)
#define MUX_PA19B_PTC_Y23                          _UINT32_(1) 
#define PINMUX_PA19B_PTC_Y23                       ((PIN_PA19B_PTC_Y23 << 16) | MUX_PA19B_PTC_Y23)
#define PORT_PA19B_PTC_Y23                         (_UINT32_(1) << 19)

#define PIN_PA20B_PTC_Y24                          _UINT32_(20)
#define MUX_PA20B_PTC_Y24                          _UINT32_(1) 
#define PINMUX_PA20B_PTC_Y24                       ((PIN_PA20B_PTC_Y24 << 16) | MUX_PA20B_PTC_Y24)
#define PORT_PA20B_PTC_Y24                         (_UINT32_(1) << 20)

#define PIN_PA21B_PTC_Y25                          _UINT32_(21)
#define MUX_PA21B_PTC_Y25                          _UINT32_(1) 
#define PINMUX_PA21B_PTC_Y25                       ((PIN_PA21B_PTC_Y25 << 16) | MUX_PA21B_PTC_Y25)
#define PORT_PA21B_PTC_Y25                         (_UINT32_(1) << 21)

#define PIN_PA22B_PTC_Y26                          _UINT32_(22)
#define MUX_PA22B_PTC_Y26                          _UINT32_(1) 
#define PINMUX_PA22B_PTC_Y26                       ((PIN_PA22B_PTC_Y26 << 16) | MUX_PA22B_PTC_Y26)
#define PORT_PA22B_PTC_Y26                         (_UINT32_(1) << 22)

#define PIN_PA23B_PTC_Y27                          _UINT32_(23)
#define MUX_PA23B_PTC_Y27                          _UINT32_(1) 
#define PINMUX_PA23B_PTC_Y27                       ((PIN_PA23B_PTC_Y27 << 16) | MUX_PA23B_PTC_Y27)
#define PORT_PA23B_PTC_Y27                         (_UINT32_(1) << 23)

